grevaillot/svd_tools/headers/ATSAMR21G18A/sercom0.h
/** SERCOM0_SPI_INTFLAG_ERROR Combined Error Interrupt **/
#define SERCOM0_SPI_INTFLAG_ERROR		(1 << 7)
/** SERCOM0_SPI_INTFLAG_SSL Slave Select Low Interrupt Flag **/
#define SERCOM0_SPI_INTFLAG_SSL		(1 << 3)
/** SERCOM0_SPI_INTFLAG_RXC Receive Complete Interrupt **/
#define SERCOM0_SPI_INTFLAG_RXC		(1 << 2)
/** SERCOM0_SPI_INTFLAG_TXC Transmit Complete Interrupt **/
#define SERCOM0_SPI_INTFLAG_TXC		(1 << 1)
/** SERCOM0_SPI_INTFLAG_DRE Data Register Empty Interrupt **/
#define SERCOM0_SPI_INTFLAG_DRE		(1 << 0)

/**@}*/

/** @defgroup sercom0_usart_intflag USARTINTFLAG USART Interrupt Flag Status and Clear
@{*/

/** SERCOM0_USART_INTFLAG_ERROR Combined Error Interrupt **/
#define SERCOM0_USART_INTFLAG_ERROR		(1 << 7)
/** SERCOM0_USART_INTFLAG_RXBRK Break Received Interrupt **/
#define SERCOM0_USART_INTFLAG_RXBRK		(1 << 5)
/** SERCOM0_USART_INTFLAG_CTSIC Clear To Send Input Change Interrupt **/
#define SERCOM0_USART_INTFLAG_CTSIC		(1 << 4)
/** SERCOM0_USART_INTFLAG_RXS Receive Start Interrupt **/
#define SERCOM0_USART_INTFLAG_RXS		(1 << 3)
/** SERCOM0_USART_INTFLAG_RXC Receive Complete Interrupt **/
#define SERCOM0_USART_INTFLAG_RXC		(1 << 2)
/** SERCOM0_USART_INTFLAG_TXC Transmit Complete Interrupt **/
#define SERCOM0_USART_INTFLAG_TXC		(1 << 1)
/** SERCOM0_USART_INTFLAG_DRE Data Register Empty Interrupt **/
#define SERCOM0_USART_INTFLAG_DRE		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cm_status I2CMSTATUS I2CM Status
@{*/

/** SERCOM0_I2CM_STATUS_LENERR Length Error **/
#define SERCOM0_I2CM_STATUS_LENERR		(1 << 10)
/** SERCOM0_I2CM_STATUS_SEXTTOUT Slave SCL Low Extend Timeout **/
#define SERCOM0_I2CM_STATUS_SEXTTOUT		(1 << 9)
/** SERCOM0_I2CM_STATUS_MEXTTOUT Master SCL Low Extend Timeout **/
#define SERCOM0_I2CM_STATUS_MEXTTOUT		(1 << 8)
/** SERCOM0_I2CM_STATUS_CLKHOLD Clock Hold **/
#define SERCOM0_I2CM_STATUS_CLKHOLD		(1 << 7)
/** SERCOM0_I2CM_STATUS_LOWTOUT SCL Low Timeout **/
#define SERCOM0_I2CM_STATUS_LOWTOUT		(1 << 6)

#define SERCOM0_I2CM_STATUS_BUSSTATE_SHIFT		4
#define SERCOM0_I2CM_STATUS_BUSSTATE_MASK		0x03
/** @defgroup sercom0_i2cm_status_busstate BUSSTATE Bus State
@{*/
/**@}*/

/** SERCOM0_I2CM_STATUS_RXNACK Received Not Acknowledge **/
#define SERCOM0_I2CM_STATUS_RXNACK		(1 << 2)
/** SERCOM0_I2CM_STATUS_ARBLOST Arbitration Lost **/
#define SERCOM0_I2CM_STATUS_ARBLOST		(1 << 1)
/** SERCOM0_I2CM_STATUS_BUSERR Bus Error **/
#define SERCOM0_I2CM_STATUS_BUSERR		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cs_status I2CSSTATUS I2CS Status
@{*/

/** SERCOM0_I2CS_STATUS_HS High Speed **/
#define SERCOM0_I2CS_STATUS_HS		(1 << 10)
/** SERCOM0_I2CS_STATUS_SEXTTOUT Slave SCL Low Extend Timeout **/
#define SERCOM0_I2CS_STATUS_SEXTTOUT		(1 << 9)
/** SERCOM0_I2CS_STATUS_CLKHOLD Clock Hold **/
#define SERCOM0_I2CS_STATUS_CLKHOLD		(1 << 7)
/** SERCOM0_I2CS_STATUS_LOWTOUT SCL Low Timeout **/
#define SERCOM0_I2CS_STATUS_LOWTOUT		(1 << 6)
/** SERCOM0_I2CS_STATUS_SR Repeated Start **/
#define SERCOM0_I2CS_STATUS_SR		(1 << 4)
/** SERCOM0_I2CS_STATUS_DIR Read/Write Direction **/
#define SERCOM0_I2CS_STATUS_DIR		(1 << 3)
/** SERCOM0_I2CS_STATUS_RXNACK Received Not Acknowledge **/
#define SERCOM0_I2CS_STATUS_RXNACK		(1 << 2)
/** SERCOM0_I2CS_STATUS_COLL Transmit Collision **/
#define SERCOM0_I2CS_STATUS_COLL		(1 << 1)
/** SERCOM0_I2CS_STATUS_BUSERR Bus Error **/
#define SERCOM0_I2CS_STATUS_BUSERR		(1 << 0)

/**@}*/

/** @defgroup sercom0_spi_status SPISTATUS SPI Status
@{*/

/** SERCOM0_SPI_STATUS_BUFOVF Buffer Overflow **/
#define SERCOM0_SPI_STATUS_BUFOVF		(1 << 2)

/**@}*/

/** @defgroup sercom0_usart_status USARTSTATUS USART Status
@{*/

/** SERCOM0_USART_STATUS_COLL Collision Detected **/
#define SERCOM0_USART_STATUS_COLL		(1 << 5)
/** SERCOM0_USART_STATUS_ISF Inconsistent Sync Field **/
#define SERCOM0_USART_STATUS_ISF		(1 << 4)
/** SERCOM0_USART_STATUS_CTS Clear To Send **/
#define SERCOM0_USART_STATUS_CTS		(1 << 3)
/** SERCOM0_USART_STATUS_BUFOVF Buffer Overflow **/
#define SERCOM0_USART_STATUS_BUFOVF		(1 << 2)
/** SERCOM0_USART_STATUS_FERR Frame Error **/
#define SERCOM0_USART_STATUS_FERR		(1 << 1)
/** SERCOM0_USART_STATUS_PERR Parity Error **/
#define SERCOM0_USART_STATUS_PERR		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cm_syncbusy I2CMSYNCBUSY I2CM Syncbusy
@{*/

/** SERCOM0_I2CM_SYNCBUSY_SYSOP System Operation Synchronization Busy **/
#define SERCOM0_I2CM_SYNCBUSY_SYSOP		(1 << 2)
/** SERCOM0_I2CM_SYNCBUSY_ENABLE SERCOM Enable Synchronization Busy **/
#define SERCOM0_I2CM_SYNCBUSY_ENABLE		(1 << 1)
/** SERCOM0_I2CM_SYNCBUSY_SWRST Software Reset Synchronization Busy **/
#define SERCOM0_I2CM_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cs_syncbusy I2CSSYNCBUSY I2CS Syncbusy
@{*/

/** SERCOM0_I2CS_SYNCBUSY_ENABLE SERCOM Enable Synchronization Busy **/
#define SERCOM0_I2CS_SYNCBUSY_ENABLE		(1 << 1)
/** SERCOM0_I2CS_SYNCBUSY_SWRST Software Reset Synchronization Busy **/
#define SERCOM0_I2CS_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup sercom0_spi_syncbusy SPISYNCBUSY SPI Syncbusy
@{*/

/** SERCOM0_SPI_SYNCBUSY_CTRLB CTRLB Synchronization Busy **/
#define SERCOM0_SPI_SYNCBUSY_CTRLB		(1 << 2)
/** SERCOM0_SPI_SYNCBUSY_ENABLE SERCOM Enable Synchronization Busy **/
#define SERCOM0_SPI_SYNCBUSY_ENABLE		(1 << 1)
/** SERCOM0_SPI_SYNCBUSY_SWRST Software Reset Synchronization Busy **/
#define SERCOM0_SPI_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup sercom0_usart_syncbusy USARTSYNCBUSY USART Syncbusy
@{*/

/** SERCOM0_USART_SYNCBUSY_CTRLB CTRLB Synchronization Busy **/
#define SERCOM0_USART_SYNCBUSY_CTRLB		(1 << 2)
/** SERCOM0_USART_SYNCBUSY_ENABLE SERCOM Enable Synchronization Busy **/
#define SERCOM0_USART_SYNCBUSY_ENABLE		(1 << 1)
/** SERCOM0_USART_SYNCBUSY_SWRST Software Reset Synchronization Busy **/
#define SERCOM0_USART_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cm_addr I2CMADDR I2CM Address
@{*/


#define SERCOM0_I2CM_ADDR_LEN_SHIFT		16
#define SERCOM0_I2CM_ADDR_LEN_MASK		0xff
/** @defgroup sercom0_i2cm_addr_len LEN Length
@{*/
/**@}*/

/** SERCOM0_I2CM_ADDR_TENBITEN Ten Bit Addressing Enable **/
#define SERCOM0_I2CM_ADDR_TENBITEN		(1 << 15)
/** SERCOM0_I2CM_ADDR_HS High Speed Mode **/
#define SERCOM0_I2CM_ADDR_HS		(1 << 14)
/** SERCOM0_I2CM_ADDR_LENEN Length Enable **/
#define SERCOM0_I2CM_ADDR_LENEN		(1 << 13)

#define SERCOM0_I2CM_ADDR_ADDR_SHIFT		0
#define SERCOM0_I2CM_ADDR_ADDR_MASK		0x7ff
/** @defgroup sercom0_i2cm_addr_addr ADDR Address Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_i2cs_addr I2CSADDR I2CS Address
@{*/


