grevaillot/svd_tools/headers/ATSAMR21G18A/sercom0.h
#define SERCOM0_I2CS_ADDR_ADDRMASK_SHIFT		17
#define SERCOM0_I2CS_ADDR_ADDRMASK_MASK		0x3ff
/** @defgroup sercom0_i2cs_addr_addrmask ADDRMASK Address Mask
@{*/
/**@}*/

/** SERCOM0_I2CS_ADDR_TENBITEN Ten Bit Addressing Enable **/
#define SERCOM0_I2CS_ADDR_TENBITEN		(1 << 15)

#define SERCOM0_I2CS_ADDR_ADDR_SHIFT		1
#define SERCOM0_I2CS_ADDR_ADDR_MASK		0x3ff
/** @defgroup sercom0_i2cs_addr_addr ADDR Address Value
@{*/
/**@}*/

/** SERCOM0_I2CS_ADDR_GENCEN General Call Address Enable **/
#define SERCOM0_I2CS_ADDR_GENCEN		(1 << 0)

/**@}*/

/** @defgroup sercom0_spi_addr SPIADDR SPI Address
@{*/


#define SERCOM0_SPI_ADDR_ADDRMASK_SHIFT		16
#define SERCOM0_SPI_ADDR_ADDRMASK_MASK		0xff
/** @defgroup sercom0_spi_addr_addrmask ADDRMASK Address Mask
@{*/
/**@}*/


#define SERCOM0_SPI_ADDR_ADDR_SHIFT		0
#define SERCOM0_SPI_ADDR_ADDR_MASK		0xff
/** @defgroup sercom0_spi_addr_addr ADDR Address Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_i2cm_data I2CMDATA I2CM Data
@{*/


#define SERCOM0_I2CM_DATA_DATA_SHIFT		0
#define SERCOM0_I2CM_DATA_DATA_MASK		0xff
/** @defgroup sercom0_i2cm_data_data DATA Data Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_i2cs_data I2CSDATA I2CS Data
@{*/


#define SERCOM0_I2CS_DATA_DATA_SHIFT		0
#define SERCOM0_I2CS_DATA_DATA_MASK		0xff
/** @defgroup sercom0_i2cs_data_data DATA Data Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_spi_data SPIDATA SPI Data
@{*/


#define SERCOM0_SPI_DATA_DATA_SHIFT		0
#define SERCOM0_SPI_DATA_DATA_MASK		0x1ff
/** @defgroup sercom0_spi_data_data DATA Data Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_usart_data USARTDATA USART Data
@{*/


#define SERCOM0_USART_DATA_DATA_SHIFT		0
#define SERCOM0_USART_DATA_DATA_MASK		0x1ff
/** @defgroup sercom0_usart_data_data DATA Data Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_i2cm_dbgctrl I2CMDBGCTRL I2CM Debug Control
@{*/

/** SERCOM0_I2CM_DBGCTRL_DBGSTOP Debug Mode **/
#define SERCOM0_I2CM_DBGCTRL_DBGSTOP		(1 << 0)

/**@}*/

/** @defgroup sercom0_spi_dbgctrl SPIDBGCTRL SPI Debug Control
@{*/

/** SERCOM0_SPI_DBGCTRL_DBGSTOP Debug Mode **/
#define SERCOM0_SPI_DBGCTRL_DBGSTOP		(1 << 0)

/**@}*/

/** @defgroup sercom0_usart_dbgctrl USARTDBGCTRL USART Debug Control
@{*/

/** SERCOM0_USART_DBGCTRL_DBGSTOP Debug Mode **/
#define SERCOM0_USART_DBGCTRL_DBGSTOP		(1 << 0)

/**@}*/
